Repository: RobotControlTechnologies/RCML_translations
Catalog: *.po
Languages: ru

source: Unknown module API version!
ru: Неизвестная версия API модуля!

source: Incompatible module API!
ru: Несовместимое API модуля!

source: Can't load %s module: %s
ru: Невозможно загрузить %s модуль: %s

source: IID "%s" already loaded!
ru: IID "%s" уже загружен!

source: Loaded %s module from: %s
ru: Загружен модуль %s из: %s

source: Can't find "%s" in module
ru: Невозможно найти "%s" в модуле

source: Mode: production
ru: Тип: промышленный

source: Module version: unknow
ru: Версия модуля: неизвестна

source: Mode: specification
ru: Тип: спецификационный

source: Module version: %d
ru: Версия модуля: %d

source: API version: %d
ru: Версия API: %d

source: In module by path: %s
ru: В модуле по пути: %s

source: wrong command index in functions:
ru: неверный индекс команды в функциях:

source: wrong axis index in axises:
ru: неверный индекс оси в осях:

source: Robot module, dont support request of aviable robots!
ru: Модуль робота не поддерживает запрос свободных роботов!

source: Can't load module: %s
ru: Невозможно загрузить модуль: %s

source: Unknown type of module: %s
ru: Неизвестный тип модуля: %s

source: Haven't %s production version of module with IID: %s
ru: Отсутствует %s промышленная версия модуля с IID: %s

source: Please restart interpreter. Don't forget enable "%s" module in config.ini!
ru: Пожалуйста перезапустите интерпретатор. Не забудьте включить модуль "%s" в config.ini!

source: Can't open pcode file: %s
ru: Невозможно открыть pcode файл: %s

source: Can't load header!
ru: Невозможно загрузить заголовок!

source: Can't execute RCML lib!
ru: Невозможно выполнить библиотеку RCML!

source: Can't load RCML program as lib!
ru: Невозможно загрузить RCML программу как библиотеку!

source: Can't find IID in the execute RCML file!
ru: Невозможно найти IID в имсполняемом файле RCML!

source: Cant load pcode file: %s
ru: Невозможно загрузить pcode файл: %s

source: PCode %d is not lib!
ru: PCode %d не библиотека!

source: Cant find function: %s
ru: Невозможно найти функцию: %s

source: This is not RCML pcode file!
ru: Это не файл pcode RCML!

source: Unknown PCode version
ru: Неизвестная версия PCode

source: Too many registers used!
ru: Задействовано cлишком много регистров!

source: Add IID or remove "export" keyword.
ru: Добавьте IID или удалите ключевое слово "export".

source: Export keyword not allowed for non-lib program.
ru: Ключевое слово export разрешено только для библиотек

source: Haven't robot: %s
ru: Нет робота: %s

source: Please restart compiler. Dont forget enable "%s" module in config.ini!
ru: Пожалуйста перезапустите компилятор. Не забудьте включить "%s" модуль в config.ini!

source: Dublicate user robot function: %s
ru: Дублирование пользовательской функции робота: %s

source: Use "IID" flag or remove "export" keyword.
ru: Изпользуйте флаг "IID" или удалите ключевое слово "export".

source: Dublicate user function: %s
ru: Дублирование пользовательской функции: %s

source: Line: %d. Undefined variable: %s
ru: Строка: %d. Неизвестная переменная: %s

source: Line: %d. Break operator outside loop!
ru: Строка: %d. Оператор break вне цикла!

source: Line: %d. Continue operator outside loop!
ru: Строка: %d. Оператор сontinue вне цикла!

source: Try: missing arguments!
ru: Try: недостаточно аргументов!

source: Try: muissing type argument!
ru: Try: не задан аргумент типа!

source: Try: unknow option name: %s
ru: Try: неизвестное имя опции: %s

source: Try: invalid type!
ru: Try: неверный тип!

source: Try: invalid option argument!
ru: Try: неверный аргумент опции!

source: Variable cant have name as some robot!
ru: Переменная не может иметь имя, такое же как робот!

source: Line: %d. Use robot vars into robot's function is prohibited!
ru: Строка: %d. Запрещено использовать переменные робота в функции робота!

source: Line: %d. List of choice modules is empty!
ru: Строка: %d. Список модулей выбора не может быть пустым!

source: Line: %d. Havent choice module: %s
ru: Строка: %d. Нет модуля выбора: %s

source: Line: %d. Havent robot: %s
ru: Строка: %d. Нет робота: %s

source: Line: %d. Use robot names or robot vars into robot's function is prohibited!
ru: Строка: %d. Запрещено использовать имена или переменные роботов в функциях роботов!

source: Line: %d. Undefined robot variable: %s
ru: Строка: %d. Неизвестная переменная робота: %s

source: Line: %d. Use of choice modules is prohibited into robot function!
ru: Строка: %d. Использование модулей выбора внутри функции робота запрещено!

source: Call to function "main" is prohibited!
ru: Вызов функции "main" запрещен!

source: The call function with the package flag is prohibited!
ru: Запрещен вызов функции с флагом пакета!

source: Too many arguments for "input" function!
ru: Слишком много аргументов для функции "input"!

source: Missing arguments for "echo" function!
ru: Пропущенны аргументы функции "echo"!

source: Invalid count arguments for "set" function!
ru: Неверное количество аргументов функции "set"!

source: Invalid wait flag parameter for "set" function!
ru: Неверный параметр флага ожидания функции "set"!

source: Unkcnow option name "%s" for "set" function!
ru: Неизвестное имя параметра "%s" в функции"set"!

source: Invalid option argument for "set" function!
ru: Неверная опция параметра функции "set"!

source: Invalid count arguments for "sleep" function!
ru: Неверное количество аргументов функции "sleep"!

source: Invalid argument for "sleep" function!
ru: Неверный аргумент функции "sleep"!

source: Invalid count arguments for "hand_control" function!
ru: Неверное количество аргументов функции "hand_control"!

source: Invalid robot argument for "hand_control" function!
ru: Неверный аргумент робота в функции "hand_control"!

source: Invalid control module argument for "hand_control" function!
ru: Неверный аргумент модуля управления в функции "hand_control"

source: Havent control module: %s
ru: Нет модуля управления: %s

source: Invalid argument by num %d for "hand_control" function!
ru: Неверный аргумент под номером %d в функции "hand_control"!

source: Invalid count arguments for "send_package" function!
ru: Неверное количество аргументов в функции "send_package"!

source: Invalid wait flag parameter for "send_package" function!
ru: Неверный параметр флага ожидания в функции "send_package"!

source: Invalid count arguments for "mutex_lock" function!
ru: Неверное количество аргументов в функции "mutex_lock"!

source: Invalid argument type for "mutex_lock" function!
ru: Неверный тип параметра в функции "mutex_lock"!

source: Invalid count arguments for "mutex_unlock" function!
ru: Неверное количество аргументов в функции "mutex_unlock"!

source: Invalid argument type for "mutex_unlock" function!
ru: Неверный тип параметра в функции "mutex_unlock"!

source: Invalid name of function for system module: %s
ru: Нневерное имя функции для системного модуля: %s

source: Warning: In line %d wait flag will be ignored by system function: %s!
ru: Предупреждение: В строке %d флаг ожидания не будет учитываться системоной функцией "%s"!

source: Function module "%s" havent function: %s
ru: В модуле функций "%s" нет функции: %s

source: Call to function "%s" of module "%s" have invalid list arguments!
ru: Вызов функции "%s" модуля "%s" содержит неверный список аргументов!

source: Unknow function module: %s
ru: Неизвестный модуль функций: %s

source: Line: %d. Lib "%s" not loaded!
ru: Строка: %d. Библиотека "%s" не загружена!

source: Line: %d. Lib "%s" havent function: %s
ru: Строка: %d. Библиотека "%s" не содержит функцию: %s

source: Line: %d. Call to function "%s" of lib "%s" have invalid list arguments!
ru: Строка: %d. Вызов функции "%s" библиотеки "%s" имеет неверный список аргументов!

source: Line: %d. Can't find for any robot for call the hand control function
ru: Строка: %d. Не могу найти какого-либо робота для вызова функции ручного управления.

source: Line: %d. Can't find robot for execute the hand control function
ru: Строка: %d. Не могу найти робота для выполнения функции ручного управления.

source: Line: %d. Invalid axis name "%s" of control module
ru: Строка: %d. Неверно задано имя оси "%s" для модуля управления

source: Line: %d. Wrong number of arguments to function: %s
ru: Строка: %d. Неверное число аргументов функции: %s

source: Line: %d. Undefined function: %s
ru: Строка: %d. Неизвестная функция: %s

source: Line: %d. Wrong number of arguments for function: %s
ru: Строка: %d. Неверное число аргументов функции: %s

source: Line: %d. Call to function "%s" of lib have invalid list arguments!
ru: Строка: %d. Вызов функции "%s" библиотеки содержит неверный список аргументов!

source: Line: %d. Wrong list of arguments for function: %s
ru: Строка: %d. Неверный список аргументов функции: %s

source: Line: %d. Can't find robot for execute function: %s
ru: Строка: %d. Невозможно найти робота для выполнения функции: %s

source: Line: %d. Wrong number of arguments!
ru: Строка: %d. Неверное число аргументов!

source: Line: %d. Can't find robot function: %s
ru: Строка: %d. Не могу найти функцию робота: %s

source: Line: %d. Wrong list of arguments for call of function: %s!
ru: Строка: %d. Неверный список аргументов для вызова функции: %s

source: Line: %d. Dublicate RCML lib name: %s
ru: Строка: %d. Дублирование имени библиотеки RCML: %s

source: Line: %d. Syntax error in define!
ru: Строка: %d. Синтаксическая ошибка в макросе!

source: Error in %s module %s:
ru: Ошибка в %s модуле %s:

source: Cant find lib search path: %s
ru: Невозможно найти путь поиска библиотек: %s

source: Lib search path is not directory: %s
ru: Путь поиска библиотек не является директорией: %s

source: RCML compiler %s - %s %s
ru: RCML компилятор %s - %s %s

source: API compability:
ru: Совместимость API:

source: Robot modules: %s
ru: Модули роботов: %s

source: Function modules: %s
ru: Модули функций: %s

source: Control modules: %s
ru: Модули управления: %s

source: Choice modules: %s
ru: Модули выбора: %s

source: Invalid param: %s
ru: Неверный параметр: %s

source: Execute pattern: rcml_compiler [--version] [--logfile <file.log>] <file.rcml> <file.rcml.pc>
ru: Пример выполнения: rcml_compiler [--version] [--logfile <file.log>] <file.rcml> <file.rcml.pc>

source: Invalid arguments!
ru: Неверные аргументы!

source: **********************Compiler***********************
ru: *********************Компилятор**********************

source: Cant find source file: %s
ru: Невозможно найти исходный файл: %s

source: Source file is not file: %s
ru: Исходный файл не является файлом: %s

source: Preprocessor parsing error(s):
ru: Препроцессорные ошибки разбора:

source: Parsing error(s):
ru: Ошибки разбора:

source: Load libs error:
ru: Ошибки загрузки библиотеки:

source: Havent main function!
ru: Отсутствует функция "main"!

source: Processing error:
ru: Ошибка обработки:

source: Programm successful compiled!
ru: Программа успешно скомпилирована!

source: The error(s) occurred:
ru: Произошли ошибки:

source: Repository not enabled!
ru: Репозиторий не включен!

source: Maybe this module just need enable in config file?
ru: Возможно этот модуль нужно просто включить в файле конфигурации?

source: Directory of %s module "%s" already exists!
ru: Директория %s модуля "%s" уже существует!

source: The "%s" %s module is not found. Try attempt to find this module into repository? [y/n]:
ru: Модуль "%s" %s не найден. Попытаться найти этот модуль в Репозитории? [y/n]:

source: The "%s" function is not found into the existing modules. Try attempt to find module, that have this function? [y/n]:
ru: Функция "%s" не найдена в имеющихся модулях. Попытаться найти модуль с данной функцией? [y/n]:

source: The %s module is not found by IID: %s. Try attempt to find module into repository? [y/n]:
ru: Модуль %s не найден по IID: %s. Попытаться найти этот модуль в Репозитории? [y/n]:

source: Check %s module in repository by name: %s...
ru: Поиск %s модуля в Репозитории по имени: %s...

source: Check %s module in repository by function name: %s...
ru: Поиск %s модуля в Репозитории по имени функции: %s...

source: Check %s module in repository by IID: %s...
ru: Поиск %s модуля в Репозитории по IID: %s...

source: failed
ru: неудачно

source: Cant find %s module in repository!
ru: Невозможно найти модуль "%s" в Репозитории!

source: success
ru: успех

source: Finded only one %s module:
ru: Найден только один %s модуль:

source: Load this module? [y/n]:
ru: Загрузить этот модуль? [y/n]:

source: Finded next %s modules:
ru: Найдены следующие %ы модули:

source: Input number of module, that will be loaded (or zero for abort loading):
ru: Введите номер модуля, который хотите згрузить (0 для отмены загрузки):

source: The loading of module is aborted by user
ru: Загрузка модуля прервана пользователем

source: Cant load WSA library. Error code: %d
ru: Не могу загрузить библиотеку WSA. Код ошибки: %d

source: Invalid WSA version!
ru: Неверная версия WSA!

source: Cant create the debug socket. Error code: %d
ru: Не могу создать сокет отладчика. Код ошибки: %d

source: Cant connect to the debug socket. Error code: %d
ru: Не могу подключиться к сокету отладчика. Код ошибки: %d

source: Cant send to the debug socket. Error code: %d
ru: Не могу отправить в сокет отладчика. Код ошибки: %d

source: The debug socket error in select function!
ru: Ошибка сокета отладчика в функции select!

source: The debug socket error with input buffer!
ru: Ошибка сокета отладчика в входном буфере!

source: Error. Close debug socket. Code: %d
ru: Ошибка. Закрытия сокета отладчика. Код: %d

source: Cant find lib with IID: %s
ru: Невозможно найти библиотеку с IID: %s

source: Prevent program run by robot module: %s
ru: Запуск программы отменен модулем робота: %s

source: Prevent program run by function module: %s
ru: Запуск программы отменен модулем функций: %s

source: Prevent program run by control module: %s
ru: Запуск программы отменен модулем управления: %s

source: Prevent program run by choice module: %s
ru: Запуск программы отменен модулем выбора: %s

source: Parameters not specified:
ru: Не задан параметр:

source: unknown parameters:
ru: Неизвестный параметр:

source: Robot module "%s" reported an error at the end of the program
ru: Модуль робота "%s" сообщил об ошибке во время завершения программы

source: Function module "%s" reported an error at the end of the program
ru: Модуль функций "%s" сообщил об ошибке во время завершения программы

source: Control module "%s" reported an error at the end of the program
ru: Модуль управления "%s" сообщил об ошибке во время завершения программы

source: Error occured during execute program: %s
ru: Произошла ошибка во время выполнения программы: %s

source: RCML interpreter %s - %s %s
ru: RCML интерпретатор %s - %s %s

source: Invalid param: %s, check his name or value. Example: -P[argument_name]=[argument_value]
ru: Неверно задан параметр: %s, проверьте его имя или значение. Пример: -P[Имя параметра]=[Значение параметра]

source: Execute pattern: rcml_interpreter [--version] [--debug] [--logfile <file.log>] <file.rcml> [rcml_params]
ru: Пример выполнения: rcml_interpreter [--version] [--debug] [--logfile <file.log>] <file.rcml> [rcml_params]

source: *********************Interpreter*********************
ru: ********************Интерпретатор********************

source: **************Thank You for using RCML!**************
ru: ****************Спасибо за выбор RCML!***************

source: Cant init %s module(s)...
ru: Невозможно проинициализировать модули:

source: Unexpected command mode!
ru: Неожидаемый режим команды!

source: Try to unlock not locked mutex '%s'!
ru: Попытка разблокировать не заблокированный мьютекс '%s'!

source: Unknow asm command %d.
ru: Неизвестная asm команда %d.

source: Unexpected wait flag value!
ru: Неожидаемое значение флага ожидания!

source: Incompatible mode of execute for user function.
ru: Несовместимый режим исполнения для пользовательской функции.

source: Unhandled exception!
ru: Необработанное исключение!

source: Cant find robot to execute function!
ru: Невозможно найти робота для выполнения функции!

source: Unknow WaitFlag for default send_package!
ru: Неизвестный WaitFlag для send_package!

source: Incompatible mode of execute for module function.
ru: Несовместимый режим исполнения для функции модуля.
